Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans->

In [22]:
import pandas as pd

d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
print(ser)
type(ser)

a    1
b    2
c    3
dtype: int64

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

Ans->

In [23]:
list1 = [i for i in range(1,11)]

ser = pd.Series(list1)
print(ser)
type(ser)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

pandas.core.series.Series

Q3. Create a Pandas DataFrame containing data:
Name      Age       Gender
Alice     25        Female
Bob       30        Male
Claire    27        Female

In [24]:
data = {
  "Name": ["Alice","Bob","Claire"],
  "Age": [25, 30, 27],
  "Gender" : ["Female", "Male","Female"]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)
print(type(df))

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans-> Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.


A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.


* DataFrames are different from the series as the DataFrame actually consists of Index objects for the axes labels (row and column labels) and Series objects for the column data.

In [25]:
data = pd.DataFrame({
    "Class 1": pd.Series([22, 33, 38], index=["math avg", "science avg",  "english avg"]),
    "Class 2": pd.Series([45, 28, 36], index=["math avg", "science avg",  "english avg"]),
    "Class 3": pd.Series([32, 41, 47], index=["math avg", "science avg",  "english avg"])
})
 
data

             Class 1  Class 2  Class 3
math avg          22       45       32
science avg       33       28       41
english avg       38       36       47

In [26]:
data = {'Mon': 22, 'Tues': 23, 'Wed': 23, 'Thurs': 24, 'Fri': 23, 'Sat': 22, 'Sun': 21}
series = pd.Series(data)
print(series)

Mon      22
Tues     23
Wed      23
Thurs    24
Fri      23
Sat      22
Sun      21
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans-> 1) Pandas use the loc attribute to return one or more specified row(s)

2) describe() : it does statistics analysis

3) head : method returns the headers and a specified number of rows, starting from the top.

4) tail : method returns the headers and a specified number of rows, starting from the bottom.

In [27]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df.loc[1])

calories    380
duration     40
Name: 1, dtype: int64

In [28]:
df = pd.read_csv('data.csv')

print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [31]:
df = pd.read_csv('data.csv')

print(df.head(10))  # default value is 5

print(df)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0
7        45    104       134     253.3
8        30    109       133     195.1
9        60     98       124     269.0
     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [32]:
print(df.tail())  # default is 5
dt=df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [33]:
dt.describe()

        Duration       Pulse  Maxpulse   Calories
count   5.000000    5.000000    5.0000    5.00000
mean   66.000000  115.000000  146.0000  310.36000
std     8.215838    7.905694    4.1833   15.75081
min    60.000000  105.000000  140.0000  290.80000
25%    60.000000  110.000000  145.0000  300.00000
50%    60.000000  115.000000  145.0000  310.20000
75%    75.000000  120.000000  150.0000  320.40000
max    75.000000  125.000000  150.0000  330.40000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans-> 
* Series:

1) Homogeneous data

2) Size Immutable –size cannot be changed

3) Values of Data Mutable

* DataFrame:

1) Heterogeneous data

2) Size Mutable

3) Data Mutable

* Panel:

1) Heterogeneous data

2) Size Mutable

3) Data Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans-> If you have a multiple series and wanted to create a pandas DataFrame by appending each series as a columns to DataFrame, you can use concat() method.

By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [37]:
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000